{"meta":{"title":"Shohret","subtitle":"この世界が間違っている","description":null,"author":"Shohret","url":"https://shohret.github.io"},"pages":[{"title":"about","date":"2017-03-14T04:06:30.000Z","updated":"2017-07-30T02:09:48.000Z","comments":false,"path":"about/index.html","permalink":"https://shohret.github.io/about/index.html","excerpt":"","text":"ئەسسالام ئەلەيكۇم Name: Shohret (شۆھرەت) Born: 1**4 Ethnicity: Uyghur (ئۇيغۇر) Languages: Uyghur, English, Japanese, Chinese, basic Turkish and Uzbek Loves: anime, manga, learning languages, drawing, calligraphy, coding, art Likes: reading, hiking, photography (not selfie), movies, chess Education: Master of Computer Science"},{"title":"tags","date":"2017-03-14T04:06:17.000Z","updated":"2017-03-16T04:05:42.000Z","comments":false,"path":"tags/index.html","permalink":"https://shohret.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2017-03-14T04:06:01.000Z","updated":"2017-03-16T04:05:58.000Z","comments":false,"path":"categories/index.html","permalink":"https://shohret.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"نى يېڭىلاش Github Credentials","slug":"Updating-Credentials-of-Github-in-Uyghur","date":"2017-04-07T18:13:04.000Z","updated":"2017-07-30T02:10:35.000Z","comments":true,"path":"2017/04/07/Updating-Credentials-of-Github-in-Uyghur/","link":"","permalink":"https://shohret.github.io/2017/04/07/Updating-Credentials-of-Github-in-Uyghur/","excerpt":"ئەسسالام ئەلەيكۇم تۈنۈگۈن كەچ Github تىكى ھېساۋات نامىمنى ئۆزگەرتكەنىدىم. Github دا ھېسھۋات نامىمنى ئۆزگەرتكەندىنكېن باشتا قۇرغان بەزى ئامبار ۋە گېتخاب بېتىنىڭمۇ url ئادىرسىنىمۇ ئۆزگەرتىش كېرەك ئ‍ىدى. مەن ئۇلانىڭ ھەممىنى ئۆزگەرتىپ ئادىن كومپۇتۇرۇمدىكى hexo بلوگىمنىمۇ تەڭشىدىم. ئاقىدا hexo نى گېتخابقا چىقارماقچى بولغاندا كۈتۈلمىگەن مەسىلىگە يولۇقتۇم. بۇيرۇق كۆزنىكىدە تۆۋەندىكى خاتالىق چىقىۋېلىپ، كومپيۇتىردىكى ئارخىپنى github قا يوللىيالمىدىم. بۇ دېمەك كومپۇتۇرۇم ۋە گىتخابنىڭ ئۇلىنىشىدا مەسەلە كۆرۈلگەنىدى.","text":"ئەسسالام ئەلەيكۇم تۈنۈگۈن كەچ Github تىكى ھېساۋات نامىمنى ئۆزگەرتكەنىدىم. Github دا ھېسھۋات نامىمنى ئۆزگەرتكەندىنكېن باشتا قۇرغان بەزى ئامبار ۋە گېتخاب بېتىنىڭمۇ url ئادىرسىنىمۇ ئۆزگەرتىش كېرەك ئ‍ىدى. مەن ئۇلانىڭ ھەممىنى ئۆزگەرتىپ ئادىن كومپۇتۇرۇمدىكى hexo بلوگىمنىمۇ تەڭشىدىم. ئاقىدا hexo نى گېتخابقا چىقارماقچى بولغاندا كۈتۈلمىگەن مەسىلىگە يولۇقتۇم. بۇيرۇق كۆزنىكىدە تۆۋەندىكى خاتالىق چىقىۋېلىپ، كومپيۇتىردىكى ئارخىپنى github قا يوللىيالمىدىم. بۇ دېمەك كومپۇتۇرۇم ۋە گىتخابنىڭ ئۇلىنىشىدا مەسەلە كۆرۈلگەنىدى.كۆرۈلگەن مەسىلە: 12FATAL remote: Permission to NewUsername/NewUername.github.io.git denied to Oldusername.fatal: unable to access 'https://github.com/NewUsername/NewUsername.github.io.git/': The requested URL returned error: 403 بۇ مەسەلە ئادەتتە Github تىكى ھېساۋات نامىڭىزنى ئۆزگەتكەندە ۋەياكى بورۇنقىغا ئوخشىمايدىغان گېتخاب ئادىرسىڭىزنى ئىشلەتكەندە كۆرۈلىدۇ. بۇنى ئوڭشاش ئۈچۈن Mac ۋە Windows سېستىمىسىدىكى ئۇسۇللار تۆۋەندىكىچە: Mac1-ئۇسۇل Finder دىن Keychain Access ئەپنى ئىزدەڭ Keychain Access دىن github.com نى ئىزدەڭ ئاندىن شۇكۆزنەكنى ئىشلەتمەكچى بولغان گېتخاب ھېساۋاتىڭىزغا ئاساسەن ئۆزگەرتىش كىرگۈزسىڭىز بولىدۇ. 2-ئۇسۇلسىز terminal ئارقىلىىقمۇ بۇ ئىشەنچە شېفىرىنى ئۈچۈرىۋېتەلەيسىز، ئاندىن سىز گېتخابدا push قىلغاندا ھېساۋات نامىڭىز بىلەن مەخپى-شېفېرىڭىز قايتا سورىلىدۇ.شۇ ۋاقىتتا يېڭىلاتسىڭىزمۇ بولىدۇ. بۇنى قىلىش ئۈچۈن تۆۋەندىكى بۇيرۇقنى كىرگۈزۈڭ. 1234git credential-osxkeychain erasehost=github.comprotocol=https[Press Return] گېتخابدىكى ئېنگىلىىسچە ئەسلى ماتىريالنى كۆرمەكچى بولسىڭىز بۇيەنى چېكىڭ. WindowsWindows تا بىز Credential Manager نى ئىزدەپ github.com نى ئۆچۈرىۋېتىمىز، ئاندىن گېتخابنى ئىشلەتكەندە ھېساۋات-نام بىلەن شېفىر قايتا سورىلىدۇ، يېڭى گېتخاب ئادىرسىڭىز بويىنچە كىرگۈزسىڭىز بولىدۇ. سولتەرەپ تەكتىدىكى ئىزدەش كۆزنىكىدىن Credential Manager نى ئىزدىپ Windows Credential نى تاللاپ github.com نى ئۆچۈرىۋەتسىڭىز بولىدۇ.","categories":[{"name":"Computer Science","slug":"Computer-Science","permalink":"https://shohret.github.io/categories/Computer-Science/"}],"tags":[{"name":"GitHub","slug":"GitHub","permalink":"https://shohret.github.io/tags/GitHub/"},{"name":"Uyghur","slug":"Uyghur","permalink":"https://shohret.github.io/tags/Uyghur/"},{"name":"git","slug":"git","permalink":"https://shohret.github.io/tags/git/"}]},{"title":"ياپونتىلىنى ئۆگېنىش ھەققىدە","slug":"How-to-Learn-Japanese","date":"2017-03-29T04:12:23.000Z","updated":"2017-07-27T21:00:43.000Z","comments":true,"path":"2017/03/28/How-to-Learn-Japanese/","link":"","permalink":"https://shohret.github.io/2017/03/28/How-to-Learn-Japanese/","excerpt":"ئەسسالام ئەلەيكۇم گۆدەك چاغلىرىمدىن باشلاپ تاھازىرغىچە ياپۇنىيەنىڭ كارتۇن فىلىمىنى (ئانىمې) كۆرۈپ كەلدىم. ھەمدە ئانىمې مىنىڭ ھاياتىمغا نۇرغۇن تەرەپلەردىن تەسىر قىلدى، مۇشۇ ئانىمېنى كۈرۈش جەريانىدا ياپون تىلىنىمۇ ئۆگەندىم. شۇڭا بۈگۈن ياپون تىلىنى ئۆگۈنۈشكە ئائىت ئۆزەمنىڭ قارىشىمنى سۆزلەپ ئۆتمەكچىمەن.","text":"ئەسسالام ئەلەيكۇم گۆدەك چاغلىرىمدىن باشلاپ تاھازىرغىچە ياپۇنىيەنىڭ كارتۇن فىلىمىنى (ئانىمې) كۆرۈپ كەلدىم. ھەمدە ئانىمې مىنىڭ ھاياتىمغا نۇرغۇن تەرەپلەردىن تەسىر قىلدى، مۇشۇ ئانىمېنى كۈرۈش جەريانىدا ياپون تىلىنىمۇ ئۆگەندىم. شۇڭا بۈگۈن ياپون تىلىنى ئۆگۈنۈشكە ئائىت ئۆزەمنىڭ قارىشىمنى سۆزلەپ ئۆتمەكچىمەن. ياپون تىلى ھەققىدەياپون تىلى بولسا ئۇيغۇرتىلىغا ئوخشاش ئالتاي تىل سىستىمىسىغا تەۋە، ۋىكىپېدىيادا بۇنىڭدىن سىرت يەنە ياپونىك (Japonic) تىل سىستىمىسى دەپمۇ چۈشەندۈرۈپتۇ. ئاناتىلى ئۇيغۇرتىلى بولغان بىز ئۈچۈن ياپون تىلىنى ئۆگۈنۈش خېلىلا ئوڭاي، چۈنكى ياپون تىلىنىڭ جۈملە قۇرۇلمىسىمۇ ئۇيغۇرچىغا ئوخشاش ئگە + تولدۇرغۇچى + پىئىل شەكلىدە قۇرۇلىدۇ. شۇڭلاشقا مېڭىمىزدە تەپەككۈر قىلغاندىكى تەپەككۈر تىلىمىز، يەنى ئۇيغۇرتىلىغىمۇ ماس كېلىدۇ. يەنە كېلىپ بىز خەنزۇ تىلىنىمۇ بىلگەشكە يېزىش ئوقۇش جەھەتتىنمۇ غەرىپ ئەللىرىدىكىلەرگە قارىغاندا ئارتۇقچىلىقىمىز بار. مەقسەت ۋە ھەيدىگۈچسىز ياپۇنتىلىنى ئۆگەنمەكچى بولدىڭىز، ياخشى. تىل ئۆگىنىش بولسا بىر ئۇزۇن مەزگىللىك جەريان. شۇڭا ئۆزىڭىزنىڭ ياپۇن تىلىنى ئۆگۈنۈشتىكى مەقسەتنى ئايدىڭ قىلىپ، ئاندىن ئۆزىڭىزنى ھەيدەپ تۇرۇپ، پىلانىڭىز بىلەن مېڭىپ ئۆگىنىڭ. قىىزىقىش بولسا ئەڭ ياخشى ھەيدىگۈچى كۈچ، بىر ئىقتىدارنى ئۆگۈنۈش جەريانىدا چىن-كۆڭلىڭىزدىن قىزىقسىڭىز ناھايىتى ياخشى ئۆگىنىپ كىتەلەيسىز. ئەلۋەتتە باشقا سىرىتقى ھەيدىگۈچمۇ بولىدۇ، مەسىلەن خىزمەت سەۋەپلىك، مەكتەپتىكى دەرىسلىك سەۋەپلىك دىگەندەك. سىرىتقى سەۋەپلەردىنمۇ ئەلۋەتتە قىزىقىش ھاسىل قىلغىلى بولىدۇ. قۇرۇق گەپنىمۇ جىق قىلدىم، تۆۋەندە تۇرلۇك ماتىرياللارنى چۇشەندۈرۈپ ئۆتەي.😁 ماتىريالدەرىسلىك كىتابمەن みんなの日本語، &lt;&lt;كۆپچىلىكنىڭ ياپونتىلى&gt;&gt; (大家的日语) دىگەن كىتابنى تەۋسىيە قىلىمەن. بۇ كىتابنى ياپوننىڭ تىل مەكتەپلىرىدىمۇ ئۇزۇن يىللاپ قوللىنىپ كەلگەن، بۇرۇن مەن تونۇيدىغان ياپونلۇق مۇئەللىممۇ بۇ كىتابنى بەك ماختايتى، خەنلە چىقاغان ئۆلچەملىك ياپون تىلى(标准日本语) دىگەن كىتابنى ئۇمۇئەللىم قەتتى ياختۇرمايتى. みんなの日本語 جەمى ئىككى قىسىم بولۇپ، ھەربىر قىسمىنىڭ تېكىسىت كىتابى بىلەن ئوقۇغۇچى پايدىلىنىش كىتابى دەپ ئىككى كىتابى بار، جەمى 4 كىتاب بولىدۇ. تېكىسىت كىتىبى تولۇق ياپونچە يېزىلغان تېكىسىت بولۇپ، ئوقۇغۇچى پايدىلىنىش كىتابىدا شۇ تېكىسىت كىتىبىدىكى دىئالوگنىڭ تەرجىمىسى، ئۇچرىغان خام سۆزلەرنىڭ چۇشەندۇرۇلىشى، ۋە گىراماتىكا بار، ئنتايىن چۈشەنچىلىك. سۆزلۈكنىمۇ باشلاشتا مۇشۇ كىتابدىكى سۆزلەرنىلا يادىلىسىڭىز بولىدۇ. ئاندىن فىلىم كۆرگەندە چۈشەنمىگەن ۋەياكى ياختۇرغان سۆز-جۈملىلەرنى خاتىرلىۋالسىڭىز سۆزلۈكىڭىزنى تېخىمۇ مول قىلىدۇ. ئاڭلاش-كۆرۈشيانفۇنىڭىزغا 沪江听力酷 دىگەن ئەپنى چۇشۇرۇپ ئىشلەتسىڭىز بولىدۇ، ھەرخىل تىلنىڭ ھەرخىل تېمىدىكى ئاۋازلىق ماتىرياللىرىنى تاپالايسىز، قولايلىق، مەن ئۆزۇم بۇرۇن مۇشۇنى ئىشلىتەتتىم. ئاندىن みんなの日本語 نىڭ CD دىسكىسىنىمۇ ئاڭلاپ بېرىڭ. ئىسىمدە قېلىشچە 沪江听力酷 دىنمۇ みんなの日本語 نىڭ ئاۋازلىق ماتېريالىنى تاپقىلى بولىدۇ. قوشتىللىق (ياپونچە ۋە خەنزۇچە) خېتى بار ئانىمې ياكى تېلۋىزىيە تېياتىرلىرىنى خېلى جىق توربەتلەردىن تاپقىلى بولىدۇ. مەن ئادەتتە ئانىمې كۆگەشكە ئانىمېگە ئائىتنىلا بىلىدىكەنمە. ئانىمېنىڭ ھەرخىل تىپتىكى ژانراسى بولىدۇ، بۇرۇن كۆرۈپ باقمىغان بولسىڭىزمۇ مىنىڭچە سىز ياختۇردىغان ئانىمې چوقۇم چىقىدۇ. ئەگەر ماڭا ئۆزىڭىز ياخرۇرىدىغان ژانرانى دەپبەرسىڭىز سىزگە بىرياخشى ئانىمې تەۋسىيە قىلالايمەن. 诸神字幕组 天空数字幕组 لۇغەتخۇجىيىڭ تور مەكتىپىنىڭ توربەت لۇغىتىنى ئىشلەتسىڭىز بولىدۇ، بۇيەرنى چىكىپ زىيارەت قىلىڭ. ئەگەر تور بولمىسىمۇ ئىشلەتكىلى بولىدىغان لۇغەت بولسىكە دىسىڭىز ئەپ بازىرىدىن ئىزدەپ بېقىڭ ۋەياكى توۋەندە ئېلخەت ئادىرسىڭىزنى قالدۇرۇپ ئەسكەرىتسىڭىز مەن ئۆزەم ئىشلىتىدىغان ئاددى بىر لۇغەتنى ئەۋەتىپ بەرسەممۇ بولىدۇ، تورلۇغىتىدەك مول بولمىسىمۇ خېلى قولايلىق. مەشىق سوئالみんなの日本語 نىڭ ئىچىدىكى مەشىقلەر ناھايىتى ياخشى، شۇنى ئىشلەپ تولۇق چۇشىنىۋالسىڭىز بولىدۇ. سۆزلەشみんなの日本語 نىڭ ئىچىدىكى دىئالوگنى ئاۋازىڭىزنى چىقىرىپ ئوقۇپ يادىلىسىڭىز بەك ياخشى. ئاندىن بىرە فىلىم كۆگەندىمۇ شۇلانى دوراپ سۆزلىسىڭىزمۇ بولىدۇ. ئەگەر سىز ئالى-مەكتەپ ئوقۇغۇچىسى بولسىڭىز، مەكتىپىڭىزدىكى مەنبەلەردىن ياخشى پايدىلىنىڭ، ئادەتتە ياپونتىلى كەسپى بارلا مەكتەپ بولسا، بىر نەچچە نەپەر ياپونلۇق مۇئەللىم ئېنىقلام بار. شۇلانى ئىزدەپ چۈشەندۇرۈپ پاراڭلىشىڭ، ھەتتا دەرىسىگىمۇ قاتنىشالايسىز. بەكلام پادىسى بولىدۇ، ياپونلۇق مۇئەللىممۇ سىزنى ئۆز ئۇقۇغۇچىسىدەك كۆرۈپ ياردەم قىلىشى،مۇڭدىشىشى مۇمكىن. مەنمۇ ئەينى ۋاقىتتا شۇندا قىلىپ ياپونتىلى كەسپىنىڭ 3، 4 چى يىللىقتىكىلەرنىڭ دەرىسىنى ئېلىۋالغان ئىدىم.ئىشقىپ مەنبەنى ياخشى قەدىرلەڭ! دۆلەت ئىچىدە ئوقۇشقا كېتىدىغان خىراجەت بەكلام ئەرزان، ئامرىكىدەك يەرگە كەلسىڭىز، دەرىسلىك كىتابنىمۇ ئېلىشقا قۇربىڭىز يەتمەسلىكى ناھايىتى نورمال ئىش، بىر دەرىسلىك كىتاب قىممەت بولغاندا ھەتتا دولەتتىكى ئالى-مەكتەپنىڭ بىر يىللىق ئوقۇش پۇلىغىمۇ تەڭ بولالايدۇ. راس گەپ! 800 دوللارلىق كىتابنى كۆرەپ، بۇرۇن بىلىمنىڭ قانچىلىك ئەرزانچىلىق يەردە تۇرغانلىقىنى ھېس قىلغان ئدىم.😅 نىشان ۋە پىلانتىلنى ئۆگىنىپ ۋايىغا يەتكۈمىگىچە قەرەرلىك ئۆگۈنۈپ تەكرارلاپ تۇرمىسا ئادەم ئاسانلا ئۇنتۇيدۇ. شۇقا بۇ مۇساپىنى بېسىپ چىقىش ئۈچۈن، نىشاننى بېكىتىپ قەرەرلىك ئۆگۈنۇپ تۇرشىڭىز كېرەك. مەسىلەن توۋەندىكىدەك پىلان تۈزۇپ، ئۆزىڭىز بىكىتكەن ۋاقىتتا ئورۇنلاپ ماڭسىڭىز ناھايىتى ياخشى. مەسىلەن قىسقا مۇددەتلىك نىشاننى بىر ھەپتىدە، ئوتتۇرا مۇددەتلىكنى بىر ئايدا، ئۇزۇن مۇددەتلىك پىلاننى بىر يىلدا ئورۇنلاپ چىقىش دىگەندەك. ئەمدى ۋاقىت ئارلىقىنى ئۆزىڭىزنىڭ ئەھۋالىغا قاۋاپ بېكىتىڭ، قەرەرلىك داۋاملشتۇرۇش ئەڭ مۇھىم. قىسقا مۇددەتلىك نىشان ياپونتىلى ئۆگىنىش كىتابىدىن بىر دەرىس ئۆگىنىش 100 تال يېڭى سۆزلۈك ئوگىنىش ئوقۇلما: بىر ئادىراق ياشلار مانگاسىنى ئوقۇش. (ياپۇننىڭ چاتما رەسىملىك كارتون كىتابلىرى، 少年漫画). فىلىم: تەكتىدە ياپونچە خىتى بار ئانىمېدىن 5 قىسىم كۆرۇش ياكى ياپوننىڭ تېلۋىزىيە تىياتېرلىرىنى كۆرسىڭىزمۇ بولىدۇ، ھەم ياختۇرغان جۇملە سۆزلەرنى كۆرەپ بولۇپ خاتىرلىۋېلىش. ئوتتۇرا مۇددەتلىك نىشان بىر دەرىسلىك كىتابنى تۈگىتىش بىر روماننى ئوقۇپ تۈگىتىش بۇرۇن ئوقۇغان مانگانى قايتا ئوقۇپ چىقىش 3000 سۆزلۈك ئۆگىنىش بىر بۆلۇم تەكتىدە ياپونچە خىتى يوق ئانىمې كۈرۈش ئۇزۇن مۇددەتلىك نىشان تەكتىدە خېتى يوق ياكى پەقەتلا ياپونچە خېتى بار ئانىمېنى كورۈپ چۇشىنىش. مانگا ياكى روماننى ئوقۇپ چۈشىنىش ياپونتىلىنى تەرجىمە قىلالاش ياپونچە پاراڭلىشالاش. ئاخىرىدائەگەر ياپونتىلىغا ئائىت بىرە سوئاللا بولسا، ئىنكاس رايونىدا خەت قالدۇرۇپ سورىسىڭىز بولىدۇ.😀","categories":[{"name":"Language","slug":"Language","permalink":"https://shohret.github.io/categories/Language/"}],"tags":[{"name":"Uyghur","slug":"Uyghur","permalink":"https://shohret.github.io/tags/Uyghur/"},{"name":"Japanese","slug":"Japanese","permalink":"https://shohret.github.io/tags/Japanese/"},{"name":"Language","slug":"Language","permalink":"https://shohret.github.io/tags/Language/"},{"name":"Tutorial","slug":"Tutorial","permalink":"https://shohret.github.io/tags/Tutorial/"}]},{"title":"Hello World","slug":"hello-world","date":"2017-03-14T04:23:38.000Z","updated":"2017-07-23T03:45:08.000Z","comments":true,"path":"2017/03/13/hello-world/","link":"","permalink":"https://shohret.github.io/2017/03/13/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}